Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetPossibleHandleBehaviors
Gets a list of possible handle behaviors for the current handle.
Returns:
Returns a list of possible handle behaviors for the current handle.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.CanSetBehavior(Autodesk.Revit.DB.Structure.RebarHandleBehavior)
Checks if the input behavior can be set for this RebarConstrainedHandle.
handleBehavior:
The behavior to be checked.
Returns:
Returns true if the input behavior can be set for this RebarConstrainedHandle, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsValid
Checks that the RebarConstrainedHandle still has access to valid Rebar handle data
and that its RebarConstraintsManager is still valid.
Returns:
Returns true if the RebarConstrainedHandle still has access to valid Rebar handle data
and that its RebarConstraintsManager is still valid, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.Move(Autodesk.Revit.DB.XYZ)
Moves the handle with the specified vector. This function applies only for shape driven rebar.
translataion:
The translation vector that will be applied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
This handle doesn't belongs to a shape driven rebar.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleSurface
Gets the surface of this handle.
Remarks:
This function takes into account the handle behavior
This function works only for shape driven rebar.
Usualy the return surface is a plane. Only for segments of bars whose shape has a RebarShapeDefinitionByArc will return a cylindrical surface.
Returns:
Returns the surface of this handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
This handle doesn't belongs to a shape driven rebar.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsEqual(Autodesk.Revit.DB.Structure.RebarConstrainedHandle)
Checks if the specified RebarConstrainedHandle is the same as 'this'.
other:
RebarConstrainedHandle to compare with.
Returns:
Returns true if the specified RebarConstrainedHandle has the same type as 'this' both are for are for the same rebar.
This doesn't take into account the handle behavior.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleName
Gets the name of the handle.
Returns:
Returns the name of the handle. In case of handles of CustomHandle type it can return null if the server that defined them is not registered.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.HandleBehavior
Identifies the handle behavior.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input behavior is not applicable for the current RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstrainedHandle
A class representing a handle on a Rebar that can be joined to a reference, such
as a host Element's surface or cover, another Rebar's handle or to a generic surface.
Remarks:
A rebar element's flexible geometry is controlled by several handles. The shape
of the bar is controlled by a handle at each end of the bar and a handle each edge.
Another handle is used to control the location of the plane in which the rebar lies.
An additional handle controls the length of a set of rebar.
RebarConstrainedHandles can only be constructed internally by Revit. They are
available to the API by querying a Rebar element's RebarConstraintsManager.
Since:
2014